In [1]:
import requests
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import datetime as dt

In [2]:
#read excel file and transform into Data Frame 
path = "Raw Data/metro_population_2019.xlsx"
data = pd.read_excel(path)
data = pd.DataFrame(data)
data.head()

,"Population of the largest metropolitan areas in the U.S. as of 2019 (in 1,000s)",Unnamed: 1
0,"New York-Newark-Jersey City, NY-NJ-PA",19216.18
1,"Los Angeles-Long Beach-Anaheim, CA",13214.80
2,"Chicago-Naperville-Elgin, IL-IN-WI",9458.54
3,"Dallas-Fort Worth-Arlington, TX",7573.14
4,"Houston-The Woodlands-Sugar Land, TX",7066.14

In [5]:
data.columns =['metro','population']
data.head()

                                   metro  population
0  New York-Newark-Jersey City, NY-NJ-PA    19216.18
1     Los Angeles-Long Beach-Anaheim, CA    13214.80
2     Chicago-Naperville-Elgin, IL-IN-WI     9458.54
3        Dallas-Fort Worth-Arlington, TX     7573.14
4   Houston-The Woodlands-Sugar Land, TX     7066.14

In [9]:
metro = data.sort_values(ascending=False, by=['population']).round(decimals=2).head(5)
metro.head()

                                   metro  population
0  New York-Newark-Jersey City, NY-NJ-PA    19216.18
1     Los Angeles-Long Beach-Anaheim, CA    13214.80
2     Chicago-Naperville-Elgin, IL-IN-WI     9458.54
3        Dallas-Fort Worth-Arlington, TX     7573.14
4   Houston-The Woodlands-Sugar Land, TX     7066.14

In [10]:
metro.to_csv(r'static\data\metro.csv', index = False)